{
  "taskName": "2-Quiz",
  "information": "При проверке задания откройте проверяемый проект на github и склонируйте его локально, запустите проект<br><br>Итеративно пройдитесь по списку требований ниже, проверяя его выполнение в приложении и отмечая соответствующие пункты справа. При обнаружении частично выполненного пункта, оставьте комментарий с помощью функции 'Добавить отзыв'. Добавлять отзывы можно и при выборе других пунктов - по желанию.<br><br>Проверяются только требования, указанные в критериях. Если какой-то момент в критериях не описан, его не проверяем и не оцениваем<br>Все сомнения трактуются на пользу студента<br>Если в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов<br>Если сомневаетесь снимать баллы или нет, не снимайте",
  "criteria": [
    {
      "type": "title",
      "title": "👍 Критерии выполнения задания +100"
    },
    {
      "type": "subtask", 
      "text": "Приложение работает как ожидается. Пользователь может пройти квиз, выбрав варианты ответов. Один вопрос - один экран. Пользователь не может выбрать несколько вариантов ответа на вопрос, только один (принцип radio buttons). Пользователь может менять свой выбор вариантов ответов, в процессе прохождения квиза. Минимальное число вопросов 5. Минимальное число вариантов ответов для каждого вопроса 5. Кнопка \"Next\" ведёт на следующий экран с вопросом, \"Previous\" - на предыдущий экран, \"Submit\" - на экран с результатом, на котором отображается результат прохождения квиза пользователем.",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "На экране результата есть кнопка \"Share\". При нажатии на \"Share\" генерируется отчет о прохождение квиза, который содержит<br>1) Результат (как на экране результата)<br>2) Список всех вопросов по порядку<br>3) Под каждым вопросом отображается выбранный пользователем вариант ответа (пример в демо-видео)<br>. Сгенерированный отчет передается в стороннее приложение через механизм неявного Intent.",
      "max": 20
    },
    {
      "type": "subtask", 
      "text": "На экранах с вопросом, на toolbar отображается порядковый номер вопроса. На toolbar находится navigation button \"<\" (кроме первого экрана с вопросом), которая работает аналогично \"Previous\".",
      "max": 10
    },
    {
      "type": "subtask", 
      "text": "Тема (Theme) приложения меняется при переходе от одного экрана с вопросом к другому. Каждому экрану с вопросом соответствует своя тема. Визуально темы отличаются друг от друга.",
      "max": 10
    },
    {
      "type": "subtask", 
      "text": "Кнопка \"Previous\" недоступна для нажатия на первом экране с вопросом, хотя может быть видима. При этом пользователь должен понимать, в каком состоянии находится кнопка - в доступном для нажатия или в недоступном состоянии. Кнопка \"Next\" недоступна пока пользователь не выбрал вариант ответа для данного экрана с вопросом. На последнем экране с вопросом кнопка \"Next\" меняется на \"Submit\"",
      "max": 20
    },
    {
      "type": "subtask", 
      "text": "Доступ к view реализован через View Binding. Для фрагмента обязательно зануление переменной в onDestroyView()",
      "max": 20
    },
    {
      "type": "title",
      "title": "☝️ Штрафы -30"
    },
    {
      "type": "penalty",
      "text": "При переходах между экранами с вопросами, выбранные варианты ответов не сохраняются. Приходится отмечать заново",
      "max": -10
    },
    {
      "type": "penalty",
      "text": "При выборе одинаковых вариантов ответов, приложение выдает разный результат квиза. Квиз недетерминирован",
      "max": -10
    },
    {
      "type": "penalty",
      "text": "Приложение падает (ANR) после различных действий пользователя. Например, нажатие на кнопку и т.д. Опишите шаги в отзыве",
      "max": -10
    }
  ]
}